# Используем Node.js в качестве базового образа
FROM node:20

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы внутрь контейнера
COPY . .

# Собираем приложение
RUN npm run build

# Устанавливаем переменную среды для указания порта
ENV PORT 3000

# Открываем порт, который будет слушать приложение
EXPOSE 3000

# Команда для запуска приложения
CMD ["npm", "start"]